## Exploratory Data Analysis (EDA)
This is a very popular dataset and has been used in many analysis projects. Some of them will be referenced later.
Following is the step by step EDA that has been done using various Python libraries

Link to the dataset: https://archive.ics.uci.edu/ml/datasets/Adult

### Objective
This is a classification problem. Objective of the project is to determine whether a person makes $50K or not given the various demographic factors and to identify which factors are the most contributing in predicting or detrmining the income.

### Downloading the Dataset

We are downloading the dataset from this link provided in the main page of the repository: https://archive.ics.uci.edu/ml/machine-learning-databases/adult/.
We will use the following 2 files:
* adult.data - contains 32,561 instances
* adult.names - contains the column names and legends
* adult.test - contains 16,281 instances

We will merge the adult.data and adult.test datasets vertically for our project as we will split them through train-test split later on

Notably, we need to change all 3 files to .csv to be able to upload to Jupyter notebook

### Dataset Attributes

This is a multivariate datatset, as a result we will need to consider multiple variables, their relationship and influence on the target valrable - income (>50K or <50K). 

**Attribute characteristic:** Both categorical and integer attributes are used  
**Number of instances:** 48,842  
**Number of attributes:** 14  
**Missing values:** Yes

#### <u>List of Attributes:<u>
* **Age:** continuous
* **Workclass:** Private, Self-emp-not-inc, Self-emp-inc, Federal-gov, Local-gov, State-gov, Without-pay, Never-worked. 
* **fnlwgt:** final weight; continuous
* **Education:** Bachelors, Some-college, 11th, HS-grad, Prof-school, Assoc-acdm, Assoc-voc, 9th, 7th-8th, 12th, Masters, 1st-4th, 10th, Doctorate, 5th-6th, Preschool.
* **Education-num:** continuous.
* **Marital-status:** Married-civ-spouse, Divorced, Never-married, Separated, Widowed, Married-spouse-absent, Married-AF-spouse. 
* **Occupation:** Tech-support, Craft-repair, Other-service, Sales, Exec-managerial, Prof-specialty, Handlers-cleaners, Machine-op-inspct, Adm-clerical, Farming-fishing, Transport-moving, Priv-house-serv, Protective-serv, Armed-Forces.
* **Relationship:** Wife, Own-child, Husband, Not-in-family, Other-relative, Unmarried.
* **Race:** White, Asian-Pac-Islander, Amer-Indian-Eskimo, Other, Black. 
* **Sex:** Female, Male.
* **Capital-gain:** continuous.
* **Capital-loss:** continuous.
* **Hours-per-week:** continuous.
* **Native-country:** United-States, Cambodia, England, Puerto-Rico, Canada, Germany, Outlying-US(Guam-USVI-etc), India, Japan, Greece, South, China, Cuba, Iran, Honduras, Philippines, Italy, Poland, Jamaica, Vietnam, Mexico, Portugal, Ireland, France, Dominican-Republic, Laos, Ecuador, Taiwan, Haiti, Columbia, Hungary, Guatemala, Nicaragua, Scotland, Thailand, Yugoslavia, El-Salvador, Trinadad&Tobago, Peru, Hong, Holand-Netherlands.

### Loading the libraries

In [177]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import plotly.express as px

### Loading the dataset to notebook

In [226]:
df1 = pd.read_csv('adult_data.csv', header = None)

# header is none as in the original dataset column names are in a separate file

In [227]:
df2 = pd.read_csv('adult_test.csv', header = None)

In [228]:
# merging the 2 datasets vertically for our project

df = pd.concat([df1, df2], ignore_index = True)

In [230]:
df.shape

(48842, 15)

The original dataset does not have the column names in the same file as the data instances. Hence, when we load the data it starts from first instance instead of the heading. To correct this, we will need to create a list with column names separately and assign it to header

In [231]:
column_names = ['age', 'workclass', 'fnlwgt', 'education', 'education-num', 'marital-status', 
                'occupation', 'relationship','race', 'sex', 'capital-gain', 'capital-loss', 'hours-per-week',
                'Native-country', 'target income']
df.columns = column_names
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,Native-country,target income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

### Understanding the Data Types

In [233]:
df.dtypes

age                int64
workclass         object
fnlwgt             int64
education         object
education-num      int64
marital-status    object
occupation        object
relationship      object
race              object
sex               object
capital-gain       int64
capital-loss       int64
hours-per-week     int64
Native-country    object
target income     object
dtype: object

In [239]:
# converting the data types to best suitable data types (for example: from object to string)
df = df.convert_dtypes()
df.dtypes

age                Int64
workclass         string
fnlwgt             Int64
education         string
education-num      Int64
marital-status    string
occupation        string
relationship      string
race              string
sex               string
capital-gain       Int64
capital-loss       Int64
hours-per-week     Int64
Native-country    string
target income     string
dtype: object

### Identifying Missing Values

In [260]:
df.describe().T

# No missing values are noticed for the numeric columns 
# (age, fnlwgt, education-num, capital-gain, capital-loss, hours-per-week)

,count,mean,std,min,25%,50%,75%,max
age,48842.0,38.643585,13.710510,17.0,28.0,37.0,48.0,90.0
fnlwgt,48842.0,189664.134597,105604.025423,12285.0,117550.5,178144.5,237642.0,1490400.0
education-num,48842.0,10.078089,2.570973,1.0,9.0,10.0,12.0,16.0
capital-gain,48842.0,1079.067626,7452.019058,0.0,0.0,0.0,0.0,99999.0
capital-loss,48842.0,87.502314,403.004552,0.0,0.0,0.0,0.0,4356.0
hours-per-week,48842.0,40.422382,12.391444,1.0,40.0,40.0,45.0,99.0

In [242]:
df.isnull().sum() # total number of null or 0 values

age               0
workclass         0
fnlwgt            0
education         0
education-num     0
marital-status    0
occupation        0
relationship      0
race              0
sex               0
capital-gain      0
capital-loss      0
hours-per-week    0
Native-country    0
target income     0
dtype: int64

##### Though it shows there are no NULL values or 0 values, we have noticed some "?" marks in the data which are essentially null values. We will need to identify those and correct the values.

In [243]:
df.nunique()

age                  74
workclass             9
fnlwgt            28523
education            16
education-num        16
marital-status        7
occupation           15
relationship          6
race                  5
sex                   2
capital-gain        123
capital-loss         99
hours-per-week       96
Native-country       42
target income         4
dtype: int64

In [246]:
df['workclass'].value_counts() #2,799 missing values

Private             33906
Self-emp-not-inc     3862
Local-gov            3136
?                    2799
State-gov            1981
Self-emp-inc         1695
Federal-gov          1432
Without-pay            21
Never-worked           10
Name: workclass, dtype: Int64

In [247]:
df['education'].value_counts() # no missing values

HS-grad         15784
Some-college    10878
Bachelors        8025
Masters          2657
Assoc-voc        2061
11th             1812
Assoc-acdm       1601
10th             1389
7th-8th           955
Prof-school       834
9th               756
12th              657
Doctorate         594
5th-6th           509
1st-4th           247
Preschool          83
Name: education, dtype: Int64

In [250]:
df['marital-status'].value_counts() # no missing values

Married-civ-spouse       22379
Never-married            16117
Divorced                  6633
Separated                 1530
Widowed                   1518
Married-spouse-absent      628
Married-AF-spouse           37
Name: marital-status, dtype: Int64

In [251]:
df['occupation'].value_counts() # 2,809 missing values

Prof-specialty       6172
Craft-repair         6112
Exec-managerial      6086
Adm-clerical         5611
Sales                5504
Other-service        4923
Machine-op-inspct    3022
?                    2809
Transport-moving     2355
Handlers-cleaners    2072
Farming-fishing      1490
Tech-support         1446
Protective-serv       983
Priv-house-serv       242
Armed-Forces           15
Name: occupation, dtype: Int64

In [252]:
df['relationship'].value_counts() # no missing values

Husband           19716
Not-in-family     12583
Own-child          7581
Unmarried          5125
Wife               2331
Other-relative     1506
Name: relationship, dtype: Int64

In [253]:
df['race'].value_counts() # no missing values

White                 41762
Black                  4685
Asian-Pac-Islander     1519
Amer-Indian-Eskimo      470
Other                   406
Name: race, dtype: Int64

In [254]:
df['sex'].value_counts() # no missing values

Male      32650
Female    16192
Name: sex, dtype: Int64

In [261]:
df['Native-country'].value_counts() # 857 missing values

United-States                 43832
Mexico                          951
?                               857
Philippines                     295
Germany                         206
Puerto-Rico                     184
Canada                          182
El-Salvador                     155
India                           151
Cuba                            138
England                         127
China                           122
South                           115
Jamaica                         106
Italy                           105
Dominican-Republic              103
Japan                            92
Guatemala                        88
Poland                           87
Vietnam                          86
Columbia                         85
Haiti                            75
Portugal                         67
Taiwan                           65
Iran                             59
Greece                           49
Nicaragua                        49
Peru                             46
Ecuador                          45
France                           38
Ireland                          37
Thailand                         30
Hong                             30
Cambodia                         28
Trinadad&Tobago                  27
Laos                             23
Yugoslavia                       23
Outlying-US(Guam-USVI-etc)       23
Scotland                         21
Honduras                         20
Hungary                          19
Holand-Netherlands                1
Name: Native-country, dtype: Int64

In [262]:
df['target income'].value_counts() # no missing values

<=50K     24720
<=50K.    12435
>50K       7841
>50K.      3846
Name: target income, dtype: Int64

##### We have found missing values in 3 variables: 'workclass', 'occupation' and 'Native-country'

### Replacing missing values with Mode (value with highest frequency)

In [263]:
df['workclass'] = df['workclass'].str.replace('?', 'Private', regex = True)
df['workclass'].value_counts()

Private             36705
Self-emp-not-inc     3862
Local-gov            3136
State-gov            1981
Self-emp-inc         1695
Federal-gov          1432
Without-pay            21
Never-worked           10
Name: workclass, dtype: Int64

In [264]:
df['occupation'] = df['occupation'].str.replace('?', 'Prof-specialty', regex = True)
df['occupation'].value_counts()

Prof-specialty       8981
Craft-repair         6112
Exec-managerial      6086
Adm-clerical         5611
Sales                5504
Other-service        4923
Machine-op-inspct    3022
Transport-moving     2355
Handlers-cleaners    2072
Farming-fishing      1490
Tech-support         1446
Protective-serv       983
Priv-house-serv       242
Armed-Forces           15
Name: occupation, dtype: Int64

In [265]:
df['Native-country'] = df['Native-country'].str.replace('?', 'United-States', regex = True)
df['Native-country'].value_counts()

United-States                 44689
Mexico                          951
Philippines                     295
Germany                         206
Puerto-Rico                     184
Canada                          182
El-Salvador                     155
India                           151
Cuba                            138
England                         127
China                           122
South                           115
Jamaica                         106
Italy                           105
Dominican-Republic              103
Japan                            92
Guatemala                        88
Poland                           87
Vietnam                          86
Columbia                         85
Haiti                            75
Portugal                         67
Taiwan                           65
Iran                             59
Greece                           49
Nicaragua                        49
Peru                             46
Ecuador                          45
France                           38
Ireland                          37
Thailand                         30
Hong                             30
Cambodia                         28
Trinadad&Tobago                  27
Laos                             23
Yugoslavia                       23
Outlying-US(Guam-USVI-etc)       23
Scotland                         21
Honduras                         20
Hungary                          19
Holand-Netherlands                1
Name: Native-country, dtype: Int64